#!/usr/bin/env python3

# 0 1 2 3 4 5 6 7 8
#
#         1
#   2           3
# 4   5       6   7
#8

import heapq as h

# создаём очередь с приоритетами (пустую)
heap = []

# вводим N чисел
n = int(input())
for _ in range(n):
    k = int(input())
    if k > 0:
        # если число > 0, вставляем в очередь
        h.heappush(heap, k)
    elif k < 0:
        # если < 0, вытаскиваем из очереди
        print(h.heappop(heap))
    else:
        # если == 0, выводим на экран всю очередь
        print(heap)

# [1, 2, 3, 5, 4, 7, 6]
# добавили 1
# [1, 2, 3, 5, 4, 7, 6, 1]
# сравнили-обменяли 1 и 5
# [1, 2, 3, 1, 4, 7, 6, 5]
# сравнили-обменяли 1 и 2
# [1, 1, 3, 2, 4, 7, 6, 5]

# [1, 1, 3, 2, 4, 7, 6, 5]
# удаляем минимальный
# [5, 1, 3, 2, 4, 7, 6, 1]
# [5, 1, 3, 2, 4, 7, 6]
# сравниваем 5 с 1 и 3, обменяем 1 и 5
# [1, 5, 3, 2, 4, 7, 6]
# сравниваем 5 с 2 и 4, обменяем 2 и 5
# [1, 2, 3, 5, 4, 7, 6]
# потомков у 5 нет (3*2+1 >= 7), останавливаемся

# [2, 4, 3, 5, 6, 7]
# вставляем 3
#  0  1  2  3  4  5  6   <- индексы
# [2, 4, 3, 5, 6, 7, 3]

# [2, 4, 3, 5, 6, 7, 3]
# удаляем минимальный
#  0  1  2  3  4  5  6   <- индексы
# [3, 4, 3, 5, 6, 7]

heap2 = []
h.heappush(heap2, (5, 'write code'))
h.heappush(heap2, (7, 'release product'))
h.heappush(heap2, (1, 'write spec'))
h.heappush(heap2, (3, 'create tests'))
while heap2 != []:
    print(h.heappop(heap2))
